---
kind: type
id: T:Autodesk.Revit.DB.ViewFamilyType
source: html/e0edeb6d-1627-3e3f-e386-be182a9dd8cb.htm
---
# Autodesk.Revit.DB.ViewFamilyType

Represents a type of a Revit view.

## Syntax (C#)
```csharp
public class ViewFamilyType : ElementType
```

## Remarks
ViewFamilyTypes represent possible types for a Revit view and contain view type related properties and options such as the default template associated to views
 created from this type. They are commonly input to new View creation methods in the Revit API.